blog/2017/03/20/spark-practise/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Spark 入门实操 - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="spark" />
  <meta name="keywords" content="spark" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                            <li class="active"><a href="/prod/">Prod</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>Spark 入门实操</h1>
            
<div id="outline-container-orgbde806c" class="outline-2">
<h2 id="orgbde806c">背景</h2>
<div class="outline-text-2" id="text-orgbde806c">
<p>
内网服务器的 spark 又跑不动了... 所以在阿里云上买两台机器, 严肃点的部署一下.
顺便把之前的 pyspark 脚本也迁移到 scala 上，可以利用起我们 java 下的资源.
</p>
</div>
</div>

<div id="outline-container-org904e254" class="outline-2">
<h2 id="org904e254">部署环境</h2>
<div class="outline-text-2" id="text-org904e254">
<ul class="org-ul">
<li>机器阿里云 2 台 4 核 16g</li>
<li>依赖软件
<ul class="org-ul">
<li>ansible-2.0</li>
<li>spark-2.1</li>
<li>jdk-1.8</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7a6f076" class="outline-2">
<h2 id="org7a6f076">部署过程</h2>
<div class="outline-text-2" id="text-org7a6f076">
<blockquote>
<p>
为了后续添加 slave 方便，在 ansible 的脚本上花了很大的功夫。根据 master 以及 slave 的 inventory 配置
</p>
<ul class="org-ul">
<li>自动配置 authorized_keys</li>
<li>自动配置 master 的 ssh_config</li>
<li>自动 配置 nfs, 以及 mount master 的工作区目录</li>
</ul>
</blockquote>

<p>
具体 ansible 脚本的执行步骤大致如下:
</p>
<ul class="org-ul">
<li>安装 jdk</li>
<li>安装 spark</li>
<li>生成以及拷贝 spark 的配置文件
<dl class="org-dl">
<dt>conf/slaves</dt><dd>配置 各个 slave 的 ssh 的别名</dd>
<dt>conf/spark-defaults.conf</dt><dd>配置 master 的 url</dd>
<dt>conf/spark-env.sh</dt><dd>配置 JAVA_HOME, SPARK_HOME, 各类 MEMORY</dd>
</dl></li>
<li>配置 master 的 ssh_key, 以及添加到 slave 的 authorized_keys 中
<ul class="org-ul">
<li>spark 的 start-all.sh 中通过 ssh 来启动所有的 slave 的 worker</li>
</ul></li>
<li>配置 nfs 共享工作区
<ul class="org-ul">
<li>运行模式下需要所有的 worker 都能根据地址访问到所要执行的 jar</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9ff9726" class="outline-2">
<h2 id="org9ff9726">发布方式</h2>
<div class="outline-text-2" id="text-org9ff9726">
<ul class="org-ul">
<li>打包
<code>sbt assembly</code></li>
<li>上传
<code>scp $WORKING_DIR/target/*.jar spark:/home/spark/workspace/</code></li>
</ul>
</div>
</div>

<div id="outline-container-org61d646f" class="outline-2">
<h2 id="org61d646f">执行方式</h2>
<div class="outline-text-2" id="text-org61d646f">
<p>
<code>crontab</code> 定期调度
</p>
<div class="org-src-container">
<pre class="src src-shell">$SPARK_HOME/bin/spark-submit --class *** /home/spark/workspace/***
</pre>
</div>
</div>
</div>

<div id="outline-container-org9527323" class="outline-2">
<h2 id="org9527323">App 示例</h2>
<div class="outline-text-2" id="text-org9527323">
<div class="org-src-container">
<pre class="src src-scala">val idsRDD = odpsOps.readTable(project, table, pr, read, numPartitions)
  .filter(_.time.isAfter(start)) // 保留最近一个月的访问记录
  .map(r =&gt; ((r.dvid, r.time), r.id)) //转换成设备号，访问日期，ID 的格式
  .groupBy(_._1).map(_._2.map(_._2)).map(_.toSet) //根据设备号和访问日期聚合，且仅保留 ID 的信息

val weightRdd = generate(idsRDD)

def listToPair[T](ls:List[T]):List[(T,T)] = ls match {
  case Nil =&gt; List()
  case a::ls =&gt; ls.map((a,_)) ++ listToPair(ls)
}

def sort(p:(Int,Int)) : (Int,Int) = if (p._1 &lt; p._2) p else p.swap

def toScore(elementNums:Map[Int,Long], pairNums:((Int,Int),Int)) : ((Int,Int), Double) = {
  val ((a,b),n) = pairNums
  ((a,b), n / Math.sqrt(1.0*elementNums(a)*elementNums(b)))
}

def generate(ls:RDD[Set[Int]]) : RDD[((Int,Int),Double)] = {
  val flattened = ls.flatMap(s=&gt;listToPair(s.toList))
  val elementNumbers = ls.flatMap(_.toList).countByValue()
  flattened.groupBy(sort).mapValues(_.size)
    .map(r=&gt;toScore(elementNumbers,r))
    .flatMap(withReverse)
}

def withReverse(res: ((Int,Int), Double)) = {
  val ((activityId, relatedId), weight) = res
  Seq(res, ((relatedId, activityId),weight))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0fd04d3" class="outline-2">
<h2 id="org0fd04d3">执行结果</h2>
<div class="outline-text-2" id="text-org0fd04d3">
<p>
同样的功能，由于
</p>
<ul class="org-ul">
<li>数据源切换到了阿里云的 odps(内网带宽千兆可以跑满)</li>
<li>减少了 nginx 日志的解析工作(odps 里可以相对结构化的存储信息)</li>
</ul>
<p>
原本 2 小时的执行任务，现在 4 分钟就能搞定...
</p>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2017-03-20</span>
        <span title="last modification date" class="post-info">2017-03-21</span>
        <span title="tags" class="post-info"><a href="/tags/spark/">spark</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
